fuzzhawk/esp32_chaos/sdkconfig.defaults
# chaosOS build defaults. `idf.py set-target esp32s3` then `idf.py build`.

# --- Target / flash / PSRAM (ESP32-S3R8: 8MB PSRAM, 32MB flash) ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Octal PSRAM at 80MHz — the 466x466 framebuffer lives here.
# NOTE: do NOT enable CONFIG_SPIRAM_FETCH_INSTRUCTIONS / CONFIG_SPIRAM_RODATA.
# They remap .text/.rodata from flash into PSRAM right after the PSRAM memory
# test and hang the boot on this board.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Custom partition table (24MB FAT reserved for voice notes) ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- CPU: both LX7 cores flat out for the pixel sims ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# app_main runs the whole frame loop, so give it a real stack.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Console over the USB-C port ---
# This board exposes the ESP32-S3's native USB (it enumerates as
# /dev/cu.usbmodem* on macOS), not a UART bridge chip.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
